In [1]:
from hossam import load_data
from pandas import Series

In [2]:
origin = load_data("grade")
origin

[data] https://data.hossam.kr/data/common/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [3]:
열순서_변경df = origin.reindex(columns=['국어', '수학', '과학', '영어'])
열순서_변경df

    국어  수학  과학   영어
이름
철수  98  88  64   77
영희  88  62  72  120
민철  92  83  79   70
수현  63  31  71   60
호영  75  90  88   50
영호  80  91  72   88
용식  82  79  90   88
나영  90  81  95   92
석영  91  89  80   90

In [4]:
행_순서변경df = origin.reindex(index = ['석영','호영', '민철','수현'])
행_순서변경df

    학년  성별  국어  영어  수학  과학
이름
석영   1  남자  91  90  89  80
호영   4  남자  75  50  90  88
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  71

In [5]:
리스트_행추가df = origin.copy()
리스트_행추가df.loc['정호'] = [2, '남자', 90, 80, 70, 60]
리스트_행추가df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
정호   2  남자  90   80  70  60

In [13]:
딕셔너리_행추가df = origin.copy()
딕셔너리_행추가df.loc['민정'] = {'성별' : '여자', '학년' : 4, '국어' :81,
                                '영어' :72, '수학' :84, '과학' :90}
딕셔너리_행추가df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
민정   4  여자  81   72  84  90

In [14]:
시리즈_행추가df = origin.copy()
s = Series([2, '남자', 90, 80, 70, 60],
           index =['학년', '성별', '국어', '영어', '수학', '과학'])

시리즈_행추가df.loc['형석']= s
시리즈_행추가df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
형석   2  남자  90   80  70  60

In [16]:
빈값_행추가df = origin.copy()
s = Series([2, '남자', 93, 71],
           index=['학년', '성별', '국어', '수학'])
빈값_행추가df.loc['석호']=s
빈값_행추가df

    학년  성별  국어     영어  수학    과학
이름
철수   1  남자  98   77.0  88  64.0
영희   2  여자  88  120.0  62  72.0
민철   1  남자  92   70.0  83  79.0
수현   3  여자  63   60.0  31  71.0
호영   4  남자  75   50.0  90  88.0
영호   4  남자  80   88.0  91  72.0
용식   2  남자  82   88.0  79  90.0
나영   1  여자  90   92.0  81  95.0
석영   1  남자  91   90.0  89  80.0
석호   2  남자  93    NaN  71   NaN

In [17]:
행_복사df = origin.copy()
행_복사df.loc['철민'] = 행_복사df.loc['철수']
행_복사df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
철민   1  남자  98   77  88  64

In [18]:
단일값_행추가df = origin.copy()
단일값_행추가df.loc['희영'] =100
단일값_행추가df

     학년   성별   국어   영어   수학   과학
이름
철수    1   남자   98   77   88   64
영희    2   여자   88  120   62   72
민철    1   남자   92   70   83   79
수현    3   여자   63   60   31   71
호영    4   남자   75   50   90   88
영호    4   남자   80   88   91   72
용식    2   남자   82   88   79   90
나영    1   여자   90   92   81   95
석영    1   남자   91   90   89   80
희영  100  100  100  100  100  100

In [19]:
빈값_행추가df = origin.copy()
s = Series([2, '남자', 93, 71],
           index=['학년', '성별', '국어', '수학'])
빈값_행추가df.loc['석호']=s
빈값_행추가df

    학년  성별  국어     영어  수학    과학
이름
철수   1  남자  98   77.0  88  64.0
영희   2  여자  88  120.0  62  72.0
민철   1  남자  92   70.0  83  79.0
수현   3  여자  63   60.0  31  71.0
호영   4  남자  75   50.0  90  88.0
영호   4  남자  80   88.0  91  72.0
용식   2  남자  82   88.0  79  90.0
나영   1  여자  90   92.0  81  95.0
석영   1  남자  91   90.0  89  80.0
석호   2  남자  93    NaN  71   NaN

In [20]:
리스트_열추가df = origin.copy()
리스트_열추가df['한국사'] = [72,56,90,None,92,90,75,80,60]
리스트_열추가df

    학년  성별  국어   영어  수학  과학   한국사
이름
철수   1  남자  98   77  88  64  72.0
영희   2  여자  88  120  62  72  56.0
민철   1  남자  92   70  83  79  90.0
수현   3  여자  63   60  31  71   NaN
호영   4  남자  75   50  90  88  92.0
영호   4  남자  80   88  91  72  90.0
용식   2  남자  82   88  79  90  75.0
나영   1  여자  90   92  81  95  80.0
석영   1  남자  91   90  89  80  60.0

In [21]:
딕셔너리_열추가df = origin.copy()
딕셔너리_열추가df['세계사'] = {"철수":90, "영희":88, "민철":72, "수현":56,
                             "호민": 65, "용식":77, "나영": 95, "석영":54}
딕셔너리_열추가df

    학년  성별  국어   영어  수학  과학   세계사
이름
철수   1  남자  98   77  88  64  90.0
영희   2  여자  88  120  62  72  88.0
민철   1  남자  92   70  83  79  72.0
수현   3  여자  63   60  31  71  56.0
호영   4  남자  75   50  90  88   NaN
영호   4  남자  80   88  91  72   NaN
용식   2  남자  82   88  79  90  77.0
나영   1  여자  90   92  81  95  95.0
석영   1  남자  91   90  89  80  54.0

In [22]:
시리즈_열추가df = origin.copy()
s = Series([72, 56, 90, 88], index=['철수', '민철', '호영', '용식'])
시리즈_열추가df['윤리'] = s
시리즈_열추가df

    학년  성별  국어   영어  수학  과학    윤리
이름
철수   1  남자  98   77  88  64  72.0
영희   2  여자  88  120  62  72   NaN
민철   1  남자  92   70  83  79  56.0
수현   3  여자  63   60  31  71   NaN
호영   4  남자  75   50  90  88  90.0
영호   4  남자  80   88  91  72   NaN
용식   2  남자  82   88  79  90  88.0
나영   1  여자  90   92  81  95   NaN
석영   1  남자  91   90  89  80   NaN

In [23]:
열_복사df = origin.copy()
열_복사df['체육'] = 열_복사df['과학']
열_복사df

    학년  성별  국어   영어  수학  과학  체육
이름
철수   1  남자  98   77  88  64  64
영희   2  여자  88  120  62  72  72
민철   1  남자  92   70  83  79  79
수현   3  여자  63   60  31  71  71
호영   4  남자  75   50  90  88  88
영호   4  남자  80   88  91  72  72
용식   2  남자  82   88  79  90  90
나영   1  여자  90   92  81  95  95
석영   1  남자  91   90  89  80  80

In [24]:
단일_값추가df = origin.copy()
단일_값추가df['체육'] =100
단일_값추가df

    학년  성별  국어   영어  수학  과학   체육
이름
철수   1  남자  98   77  88  64  100
영희   2  여자  88  120  62  72  100
민철   1  남자  92   70  83  79  100
수현   3  여자  63   60  31  71  100
호영   4  남자  75   50  90  88  100
영호   4  남자  80   88  91  72  100
용식   2  남자  82   88  79  90  100
나영   1  여자  90   92  81  95  100
석영   1  남자  91   90  89  80  100

In [26]:
행_삭제df = origin.copy()
행_삭제df = 행_삭제df.drop(index='철수')
행_삭제df

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [28]:
다중삭제df = origin.copy()
다중삭제결과df = 다중삭제df.drop(index=['철수', '민철', '수현'])
다중삭제결과df

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80